app/controllers/todos_controller.rb

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "owner", "complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "walk the dog"], ["owner", "chip.irek@gmail.com"], ["complete", "f"], ["created_at", "2017-09-19 16:31:40.541428"], ["updated_at", "2017-09-19 16:31:40.541428"]]

  def update
    todo = Todo.find(params[:id])
    todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "todos" SET "complete" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["complete", "t"], ["updated_at", "2017-09-21 22:12:36.176704"], ["id", 4]]